var TUTORIAL_SCENES = [
	{
		"text": "Добро пожаловать на арену Arbour,^1000 новичёк! Я являюсь судьёй этой арены,^1000 и сейчас я покажу тебе,^1000 что нужно делать,^1000 чтобы победить.",
		"action": false
	},
	{
		"text": 'На игровой арене находятся клетки.^1500 Если на клетке находится кактус либо гора -^1000 клетка будет являться препятствием для передвижения.^1500 Клетку с припятствием можно удалить раз за игру,^1000 используя на панели действий(снизу) кнопку "Q".',
		"action": true,
		"action_text": "Попробуй удалить одно из препятствий,^1000 используя кнопку Q в панели действий."
	},
	{
		"text": 'В панели действий первая кнопка "C" отвечает за добавление героя на арену.^1500 При нажатии на её,^1000 у тебя откроется меню выбора одного из твоих героев.^1500 Во время боя на карту можно разместить максимум трёх героев.^1500 Если всех твоих героев убьют -^1000 ты проиграл.',
		"action": true,
		"action_text": `После выбора героя,^1000 клетки,^1000 на которые нельзя разместить героя -^1000 еле заметны.^1500 Выбери героя "Огонь" и помести его на игровую карту.`
	},
	{
		"text": "Если ты нажмёшь на своего героя на карте -^1000 слева у тебя появятся его характеристики.",
		"action": true,
		"action_text": `Попробуй выбрать на карте недавно добавленного героя.`
	},
	{
		"text": "В характеристике героя на первых трёх строчках написаны названия героя вместе с его типом,^1000 уровнем героя и редкостью героя.",
		"action": false
	},
	{
		"text": "Далее написаны основные характеристики:^1000 сила,^1000 интеллект,^1000 ловкость,^1000 мудрость и телосложение.",
		"action": false
	},
	{
		"text": 'Характеристика "Сила" отвечает за силу удара героя.^1500 Характеристика "Интеллект" отвечает за силу магической атаки.^1500 Характеристика "Ловкость" отвечает за скорость передвижения.^1500 Характеристика "Мудрость" отвечает за максимальное количество магии у героя.^1500 Характеристика "Телосложение" отвечает за максимальное количество здоровья у героя.',
		"action": false
	},
	{
		"text": "Следующие характеристики сразу же понятны по их названиям.",
		"action": false
	},
	{
		"text": 'В зависимости от типа героя(огненный,^1000 зимний,^1000 дух,^1000 друид)^1000 при его выборе в панели действий появляются возможные действия героя на кнопках "1-6".^1500 ',
		"action": true,
		"action_text": 'Попробуй атаковать противника кнопками "1-6".'
	},
	{
		"text": 'Противников на арене можно атаковать различными способностями:^1000 обычная атака,^1000 либо магическая атака.^1500 Также можно восстанавливать здоровье и магию.',
		"action": false
	},
	{
		"text": 'Героя можно перемещать по арене.^1500 Пройти по препятствиям(горы,^1000 кактусы)^1000 герой не может.^1500 Передвижение героя можно осуществить по нажатию на кнопку "M" в правом нижнем углу.^1500 После нажатия на кнопку "M",^1000 на арене подсветятся ближайшие клетки,^1000 на которые можно передвинуть героя.',
		"action": true,
		"action_text": 'Попробуй переместить героя,^1000 используя кнопку "M" в правом нижнем углу.'
	},
	{
		"text": 'Обучение завершено!^1500 Теперь ты можешь участвовать в боях против реальных игроков,^1000 встретимся на арене.^1500 Удачи!',
		"action": true,
		"action_text": "В награду за пройденное обучение,^1000 я вручаю тебе три сундука с героями.^1500 Ты можешь открыть их в магазине."
	}
];